---
Description: Downloads the latest Amazon DCV Client for macOS (arm64/Apple Silicon).
Identifier: com.lashomb.download.AmazonDCVClient-arm64
MinimumVersion: '2.3'

Input:
  NAME: AmazonDCVClient-arm64
  DOWNLOAD_URL: https://d1uj6qtbmh3dt5.cloudfront.net/nice-dcv-viewer.arm64.dmg

Process:
  - Processor: URLDownloader
    Arguments:
      url: '%DOWNLOAD_URL%'
      filename: '%NAME%.dmg'

  - Processor: StopProcessingIf
    Arguments:
      predicate: download_changed == FALSE

  - Processor: EndOfCheckPhase
